cmsis-svd/cmsis-svd/data/TexasInstruments/MSP430G2553.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WATCHDOG_TIMER</name>
      <description>Watchdog Timer</description>
      <baseAddress>288</baseAddress>
      <registers>
        <register>
          <name>WDTCTL</name>
          <description>Watchdog Timer Control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTIS0</name>
              <description>WDTIS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTIS1</name>
              <description>WDTIS1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTSSEL</name>
              <description>WDTSSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>WDTCNTCL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>WDTTMSEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTNMI</name>
              <description>WDTNMI</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTNMIES</name>
              <description>WDTNMIES</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>WDTHOLD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>Flash</description>
      <baseAddress>296</baseAddress>
      <registers>
        <register>
          <name>FCTL1</name>
          <description>FLASH Control 1</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ERASE</name>
              <description>Enable bit for Flash segment erase</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MERAS</name>
              <description>Enable bit for Flash mass erase</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRT</name>
              <description>Enable bit for Flash write</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKWRT</name>
              <description>Enable bit for Flash segment write</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTL2</name>
          <description>FLASH Control 2</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FN0</name>
              <description>Divide Flash clock by 1 to 64 using FN0 to FN5 according to:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN1</name>
              <description>32*FN5 + 16*FN4 + 8*FN3 + 4*FN2 + 2*FN1 + FN0 + 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN2</name>
              <description>FN2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN3</name>
              <description>FN3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN4</name>
              <description>FN4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FN5</name>
              <description>FN5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSSEL</name>
              <description>Flash clock select 0 */        /* to distinguish from USART SSELx</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSSEL_0</name>
                  <description>Flash clock select: 0 - ACLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSSEL_1</name>
                  <description>Flash clock select: 1 - MCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSSEL_2</name>
                  <description>Flash clock select: 2 - SMCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSSEL_3</name>
                  <description>Flash clock select: 3 - SMCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTL3</name>
          <description>FLASH Control 3</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Flash busy: 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYV</name>
              <description>Flash Key violation flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCVIFG</name>
              <description>Flash Access violation flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT</name>
              <description>Wait flag for segment write</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock bit: 1 - Flash is locked (read only)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMEX</name>
              <description>Flash Emergency Exit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKA</name>
              <description>Segment A Lock bit: read = 1 - Segment is locked (read only)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAIL</name>
              <description>Last Program or Erase failed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
