cmsis-svd/cmsis-svd/data/TexasInstruments/MSP430G2553.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65504</baseAddress>
      <interrupt>
        <name>TRAPINT</name>
        <description>0xFFE0 TRAPINT</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFE4 Port 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFE6 Port 2</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>ADC10</name>
        <description>0xFFEA ADC10</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>USCIAB0TX</name>
        <description>0xFFEC USCI A0/B0 Transmit</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>USCIAB0RX</name>
        <description>0xFFEE USCI A0/B0 Receive</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A1</name>
        <description>0xFFF0 Timer0_A CC1, TA0</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A0</name>
        <description>0xFFF2 Timer0_A CC0</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFF4 Watchdog Timer</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>COMPARATORA</name>
        <description>0xFFF6 Comparator A</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A1</name>
        <description>0xFFF8 Timer1_A CC1-4, TA1</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A0</name>
        <description>0xFFFA Timer1_A CC0</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>NMI</name>
        <description>0xFFFC Non-maskable</description>
        <value>14</value>
      </interrupt>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <msp430_svd>
      <version>0.3.0</version>
      <commit_hash>bbf15ed</commit_hash>
    </msp430_svd>
  </vendorExtensions>
</device>
